wagiminator/MCU-Templates/CH32V103/template/src/ch32v103.h
// ===================================================================================
// Header File for CH32V103 Microcontrollers                                  * v1.0 *
// ===================================================================================
// This contains a copy of ch32v10x.h and core_riscv.h and other misc functions.
// NOTE: This file includes modifications by Stefan Wagner.
/********************************** (C) COPYRIGHT  *******************************
 * File Name          : ch32v10x.h
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2020/04/30
 * Description        : CH32V10x Device Peripheral Access Layer Header File.
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * SPDX-License-Identifier: Apache-2.0
 *******************************************************************************/

#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>

#define __MPU_PRESENT             0  /* Other CH32 devices does not provide an MPU */
#define __Vendor_SysTickConfig    0  /* Set to 1 if different SysTick Config is used */

#define HSE_VALUE               ((uint32_t)8000000) /* Value of the External oscillator in Hz */
#define HSI_VALUE               ((uint32_t)8000000) /* Value of the Internal oscillator in Hz */
#define HSE_STARTUP_TIMEOUT     ((uint16_t)0x500)   /* Time out for HSE start up */
#define LSE_VALUE               ((uint32_t)32768)   /* Value of the External low-speed oscillator in Hz */
#define LSI_VALUE               ((uint32_t)40000)   /* Value of the Internal low-speed oscillator in Hz */

/* IO definitions */
#ifdef __cplusplus
  #define   __I     volatile            /*!< defines 'read only' permissions    */
#else
  #define   __I     volatile const      /*!< defines 'read only' permissions    */
#endif
#define     __O     volatile            /*!< defines 'write only' permissions   */
#define     __IO    volatile            /*!< defines 'read / write' permissions */

/* define compiler specific symbols */
#if defined(__CC_ARM)
  #define __ASM       __asm     /*!< asm keyword for ARM Compiler          */
  #define __INLINE    __inline  /*!< inline keyword for ARM Compiler       */

#elif defined(__ICCARM__)
  #define __ASM       __asm   /*!< asm keyword for IAR Compiler          */
  #define __INLINE    inline  /*!< inline keyword for IAR Compiler. Only avaiable in High optimization mode! */

#elif defined(__GNUC__)
  #define __ASM       __asm   /*!< asm keyword for GNU Compiler          */
  #define __INLINE    inline  /*!< inline keyword for GNU Compiler       */

#elif defined(__TASKING__)
  #define __ASM       __asm   /*!< asm keyword for TASKING Compiler      */
  #define __INLINE    inline  /*!< inline keyword for TASKING Compiler   */
#endif

typedef enum {NoREADY = 0, READY = !NoREADY} ErrorStatus;
typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;

#define   RV_STATIC_INLINE  static  inline

/* Interrupt Number Definition, according to the selected device */
typedef enum IRQn
{
    /******  RISC-V Processor Exceptions Numbers *******************************************************/
    NonMaskableInt_IRQn = 2, /* 2 Non Maskable Interrupt                             */
    EXC_IRQn = 3,            /* 4 Exception Interrupt                                */
    SysTicK_IRQn = 12,       /* 12 System timer Interrupt                            */
    Software_IRQn = 14,      /* 14 software Interrupt                                */

    /******  RISC-V specific Interrupt Numbers *********************************************************/
    WWDG_IRQn = 16,          /* Window WatchDog Interrupt                            */
    PVD_IRQn = 17,           /* PVD through EXTI Line detection Interrupt            */
    TAMPER_IRQn = 18,        /* Tamper Interrupt                                     */
    RTC_IRQn = 19,           /* RTC global Interrupt                                 */
    FLASH_IRQn = 20,         /* FLASH global Interrupt                               */
    RCC_IRQn = 21,           /* RCC global Interrupt                                 */
    EXTI0_IRQn = 22,         /* EXTI Line0 Interrupt                                 */
    EXTI1_IRQn = 23,         /* EXTI Line1 Interrupt                                 */
    EXTI2_IRQn = 24,         /* EXTI Line2 Interrupt                                 */
    EXTI3_IRQn = 25,         /* EXTI Line3 Interrupt                                 */
    EXTI4_IRQn = 26,         /* EXTI Line4 Interrupt                                 */
    DMA1_Channel1_IRQn = 27, /* DMA1 Channel 1 global Interrupt                      */
    DMA1_Channel2_IRQn = 28, /* DMA1 Channel 2 global Interrupt                      */
    DMA1_Channel3_IRQn = 29, /* DMA1 Channel 3 global Interrupt                      */
    DMA1_Channel4_IRQn = 30, /* DMA1 Channel 4 global Interrupt                      */
    DMA1_Channel5_IRQn = 31, /* DMA1 Channel 5 global Interrupt                      */
    DMA1_Channel6_IRQn = 32, /* DMA1 Channel 6 global Interrupt                      */
    DMA1_Channel7_IRQn = 33, /* DMA1 Channel 7 global Interrupt                      */
    ADC_IRQn = 34,           /* ADC1 global Interrupt                                */
    EXTI9_5_IRQn = 39,       /* External Line[9:5] Interrupts                        */
    TIM1_BRK_IRQn = 40,      /* TIM1 Break Interrupt                                 */
    TIM1_UP_IRQn = 41,       /* TIM1 Update Interrupt                                */
    TIM1_TRG_COM_IRQn = 42,  /* TIM1 Trigger and Commutation Interrupt               */
    TIM1_CC_IRQn = 43,       /* TIM1 Capture Compare Interrupt                       */
    TIM2_IRQn = 44,          /* TIM2 global Interrupt                                */
    TIM3_IRQn = 45,          /* TIM3 global Interrupt                                */
    TIM4_IRQn = 46,          /* TIM4 global Interrupt                                */
    I2C1_EV_IRQn = 47,       /* I2C1 Event Interrupt                                 */
    I2C1_ER_IRQn = 48,       /* I2C1 Error Interrupt                                 */
    I2C2_EV_IRQn = 49,       /* I2C2 Event Interrupt                                 */
    I2C2_ER_IRQn = 50,       /* I2C2 Error Interrupt                                 */
    SPI1_IRQn = 51,          /* SPI1 global Interrupt                                */
    SPI2_IRQn = 52,          /* SPI2 global Interrupt                                */
    USART1_IRQn = 53,        /* USART1 global Interrupt                              */
    USART2_IRQn = 54,        /* USART2 global Interrupt                              */
    USART3_IRQn = 55,        /* USART3 global Interrupt                              */
    EXTI15_10_IRQn = 56,     /* External Line[15:10] Interrupts                      */
    RTCAlarm_IRQn = 57,      /* RTC Alarm through EXTI Line Interrupt                */
    USBWakeUp_IRQn = 58,     /* USB WakeUp from suspend through EXTI Line Interrupt  */
    USBHD_IRQn = 59,         /* USBHD Interrupt                                      */
} IRQn_Type;

#define HardFault_IRQn    EXC_IRQn
#define ADC1_2_IRQn       ADC_IRQn

/* Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSI_Value             HSI_VALUE
#define HSE_Value             HSE_VALUE
#define HSEStartUp_TimeOut    HSE_STARTUP_TIMEOUT

/* Analog to Digital Converter */
typedef struct
{
    __IO uint32_t STATR;
    __IO uint32_t CTLR1;
    __IO uint32_t CTLR2;
    __IO uint32_t SAMPTR1;
    __IO uint32_t SAMPTR2;
    __IO uint32_t IOFR1;
    __IO uint32_t IOFR2;
    __IO uint32_t IOFR3;
    __IO uint32_t IOFR4;
    __IO uint32_t WDHTR;
    __IO uint32_t WDLTR;
    __IO uint32_t RSQR1;
    __IO uint32_t RSQR2;
    __IO uint32_t RSQR3;
    __IO uint32_t ISQR;
    __IO uint32_t IDATAR1;
    __IO uint32_t IDATAR2;
    __IO uint32_t IDATAR3;
    __IO uint32_t IDATAR4;
    __IO uint32_t RDATAR;
} ADC_TypeDef;

/* Backup Registers */
typedef struct
{
    uint32_t      RESERVED0;
    __IO uint16_t DATAR1;
    uint16_t      RESERVED1;
    __IO uint16_t DATAR2;
    uint16_t      RESERVED2;
    __IO uint16_t DATAR3;
    uint16_t      RESERVED3;
    __IO uint16_t DATAR4;
    uint16_t      RESERVED4;
    __IO uint16_t DATAR5;
    uint16_t      RESERVED5;
    __IO uint16_t DATAR6;
    uint16_t      RESERVED6;
    __IO uint16_t DATAR7;
    uint16_t      RESERVED7;
    __IO uint16_t DATAR8;
    uint16_t      RESERVED8;
    __IO uint16_t DATAR9;
    uint16_t      RESERVED9;
    __IO uint16_t DATAR10;
    uint16_t      RESERVED10;
    __IO uint16_t OCTLR;
    uint16_t      RESERVED11;
    __IO uint16_t TPCTLR;
    uint16_t      RESERVED12;
    __IO uint16_t TPCSR;
    uint16_t      RESERVED13[5];
    __IO uint16_t DATAR11;
    uint16_t      RESERVED14;
    __IO uint16_t DATAR12;
    uint16_t      RESERVED15;
    __IO uint16_t DATAR13;
    uint16_t      RESERVED16;
    __IO uint16_t DATAR14;
    uint16_t      RESERVED17;
    __IO uint16_t DATAR15;
    uint16_t      RESERVED18;
    __IO uint16_t DATAR16;
    uint16_t      RESERVED19;
    __IO uint16_t DATAR17;
    uint16_t      RESERVED20;
    __IO uint16_t DATAR18;
    uint16_t      RESERVED21;
    __IO uint16_t DATAR19;
    uint16_t      RESERVED22;
    __IO uint16_t DATAR20;
    uint16_t      RESERVED23;
    __IO uint16_t DATAR21;
    uint16_t      RESERVED24;
    __IO uint16_t DATAR22;
    uint16_t      RESERVED25;
    __IO uint16_t DATAR23;
    uint16_t      RESERVED26;
    __IO uint16_t DATAR24;
    uint16_t      RESERVED27;
    __IO uint16_t DATAR25;
    uint16_t      RESERVED28;
    __IO uint16_t DATAR26;
    uint16_t      RESERVED29;
    __IO uint16_t DATAR27;
    uint16_t      RESERVED30;
    __IO uint16_t DATAR28;
    uint16_t      RESERVED31;
    __IO uint16_t DATAR29;
    uint16_t      RESERVED32;
    __IO uint16_t DATAR30;
    uint16_t      RESERVED33;
    __IO uint16_t DATAR31;
    uint16_t      RESERVED34;
    __IO uint16_t DATAR32;
    uint16_t      RESERVED35;
    __IO uint16_t DATAR33;
    uint16_t      RESERVED36;
    __IO uint16_t DATAR34;
    uint16_t      RESERVED37;
    __IO uint16_t DATAR35;
    uint16_t      RESERVED38;
    __IO uint16_t DATAR36;
    uint16_t      RESERVED39;
    __IO uint16_t DATAR37;
    uint16_t      RESERVED40;
    __IO uint16_t DATAR38;
    uint16_t      RESERVED41;
    __IO uint16_t DATAR39;
    uint16_t      RESERVED42;
    __IO uint16_t DATAR40;
    uint16_t      RESERVED43;
    __IO uint16_t DATAR41;
    uint16_t      RESERVED44;
    __IO uint16_t DATAR42;
    uint16_t      RESERVED45;
} BKP_TypeDef;

/* CRC Calculation Unit */
typedef struct
{
    __IO uint32_t DATAR;
    __IO uint8_t  IDATAR;
    uint8_t       RESERVED0;
    uint16_t      RESERVED1;
    __IO uint32_t CTLR;
} CRC_TypeDef;

