wagiminator/MCU-Templates/CH32V103/template/src/ch32v103.h
/* Memory mapped structure for Program Fast Interrupt Controller (PFIC) */
typedef struct{
    __I  uint32_t ISR[8];
    __I  uint32_t IPR[8];
    __IO uint32_t ITHRESDR;
    __IO uint32_t FIBADDRR;
    __IO uint32_t CFGR;
    __I  uint32_t GISR;
    uint8_t RESERVED0[0x10];
    __IO uint32_t FIOFADDRR[4];
    uint8_t RESERVED1[0x90];
    __O  uint32_t IENR[8];
    uint8_t RESERVED2[0x60];
    __O  uint32_t IRER[8];
    uint8_t RESERVED3[0x60];
    __O  uint32_t IPSR[8];
    uint8_t RESERVED4[0x60];
    __O  uint32_t IPRR[8];
    uint8_t RESERVED5[0x60];
    __IO uint32_t IACTR[8];
    uint8_t RESERVED6[0xE0];
    __IO uint8_t IPRIOR[256];
    uint8_t RESERVED7[0x810];
    __IO uint32_t SCTLR;
} PFIC_Type;

/* Memory mapped structure for SysTick */
typedef struct
{
    __IO uint32_t CTLR;
    __IO uint32_t CNTL;
    __IO uint32_t CNTH;
    __IO uint32_t CMPL;
    __IO uint32_t CMPH;
} SysTick_Type;

/* Peripheral memory map */
#define FLASH_BASE                              ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE                               ((uint32_t)0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE                             ((uint32_t)0x40000000) /* Peripheral base address in the alias region */

#define APB1PERIPH_BASE                         (PERIPH_BASE)
#define APB2PERIPH_BASE                         (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE                          (PERIPH_BASE + 0x20000)

#define TIM2_BASE                               (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE                               (APB1PERIPH_BASE + 0x0400)
#define TIM4_BASE                               (APB1PERIPH_BASE + 0x0800)
#define TIM5_BASE                               (APB1PERIPH_BASE + 0x0C00)
#define TIM6_BASE                               (APB1PERIPH_BASE + 0x1000)
#define TIM7_BASE                               (APB1PERIPH_BASE + 0x1400)
#define TIM12_BASE                              (APB1PERIPH_BASE + 0x1800)
#define TIM13_BASE                              (APB1PERIPH_BASE + 0x1C00)
#define TIM14_BASE                              (APB1PERIPH_BASE + 0x2000)
#define RTC_BASE                                (APB1PERIPH_BASE + 0x2800)
#define WWDG_BASE                               (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE                               (APB1PERIPH_BASE + 0x3000)
#define SPI2_BASE                               (APB1PERIPH_BASE + 0x3800)
#define SPI3_BASE                               (APB1PERIPH_BASE + 0x3C00)
#define USART2_BASE                             (APB1PERIPH_BASE + 0x4400)
#define USART3_BASE                             (APB1PERIPH_BASE + 0x4800)
#define UART4_BASE                              (APB1PERIPH_BASE + 0x4C00)
#define UART5_BASE                              (APB1PERIPH_BASE + 0x5000)
#define I2C1_BASE                               (APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE                               (APB1PERIPH_BASE + 0x5800)
#define BKP_BASE                                (APB1PERIPH_BASE + 0x6C00)
#define PWR_BASE                                (APB1PERIPH_BASE + 0x7000)
#define DAC_BASE                                (APB1PERIPH_BASE + 0x7400)

#define AFIO_BASE                               (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE                               (APB2PERIPH_BASE + 0x0400)
#define GPIOA_BASE                              (APB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE                              (APB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE                              (APB2PERIPH_BASE + 0x1000)
#define GPIOD_BASE                              (APB2PERIPH_BASE + 0x1400)
#define GPIOE_BASE                              (APB2PERIPH_BASE + 0x1800)
#define GPIOF_BASE                              (APB2PERIPH_BASE + 0x1C00)
#define GPIOG_BASE                              (APB2PERIPH_BASE + 0x2000)
#define ADC1_BASE                               (APB2PERIPH_BASE + 0x2400)
#define ADC2_BASE                               (APB2PERIPH_BASE + 0x2800)
#define TIM1_BASE                               (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE                               (APB2PERIPH_BASE + 0x3000)
#define TIM8_BASE                               (APB2PERIPH_BASE + 0x3400)
#define USART1_BASE                             (APB2PERIPH_BASE + 0x3800)
#define ADC3_BASE                               (APB2PERIPH_BASE + 0x3C00)
#define TIM15_BASE                              (APB2PERIPH_BASE + 0x4000)
#define TIM16_BASE                              (APB2PERIPH_BASE + 0x4400)
#define TIM17_BASE                              (APB2PERIPH_BASE + 0x4800)
#define TIM9_BASE                               (APB2PERIPH_BASE + 0x4C00)
#define TIM10_BASE                              (APB2PERIPH_BASE + 0x5000)
#define TIM11_BASE                              (APB2PERIPH_BASE + 0x5400)

#define DMA1_BASE                               (AHBPERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE                      (AHBPERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE                      (AHBPERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE                      (AHBPERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE                      (AHBPERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE                      (AHBPERIPH_BASE + 0x0058)
#define DMA1_Channel6_BASE                      (AHBPERIPH_BASE + 0x006C)
#define DMA1_Channel7_BASE                      (AHBPERIPH_BASE + 0x0080)
#define DMA2_BASE                               (AHBPERIPH_BASE + 0x0400)
#define DMA2_Channel1_BASE                      (AHBPERIPH_BASE + 0x0408)
#define DMA2_Channel2_BASE                      (AHBPERIPH_BASE + 0x041C)
#define DMA2_Channel3_BASE                      (AHBPERIPH_BASE + 0x0430)
#define DMA2_Channel4_BASE                      (AHBPERIPH_BASE + 0x0444)
#define DMA2_Channel5_BASE                      (AHBPERIPH_BASE + 0x0458)
#define RCC_BASE                                (AHBPERIPH_BASE + 0x1000)
#define CRC_BASE                                (AHBPERIPH_BASE + 0x3000)
#define USBHD_BASE                              (AHBPERIPH_BASE + 0x3400)

#define FLASH_R_BASE                            (AHBPERIPH_BASE + 0x2000) /* Flash registers base address */
#define OB_BASE                                 ((uint32_t)0x1FFFF800)    /* Flash Option Bytes base address */
#define DBGMCU_BASE                             ((uint32_t)0xE000D000)
#define EXTEN_BASE                              ((uint32_t)0x40023800)

