wagiminator/MCU-Templates/CH32V103/template/src/ch32v103.h
/*******************  Bit definition for WWDG_CTLR register  ********************/
#define WWDG_CTLR_T                             ((uint8_t)0x7F) /* T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define WWDG_CTLR_T0                            ((uint8_t)0x01) /* Bit 0 */
#define WWDG_CTLR_T1                            ((uint8_t)0x02) /* Bit 1 */
#define WWDG_CTLR_T2                            ((uint8_t)0x04) /* Bit 2 */
#define WWDG_CTLR_T3                            ((uint8_t)0x08) /* Bit 3 */
#define WWDG_CTLR_T4                            ((uint8_t)0x10) /* Bit 4 */
#define WWDG_CTLR_T5                            ((uint8_t)0x20) /* Bit 5 */
#define WWDG_CTLR_T6                            ((uint8_t)0x40) /* Bit 6 */

#define WWDG_CTLR_WDGA                          ((uint8_t)0x80) /* Activation bit */

/*******************  Bit definition for WWDG_CFGR register  *******************/
#define WWDG_CFGR_W                             ((uint16_t)0x007F) /* W[6:0] bits (7-bit window value) */
#define WWDG_CFGR_W0                            ((uint16_t)0x0001) /* Bit 0 */
#define WWDG_CFGR_W1                            ((uint16_t)0x0002) /* Bit 1 */
#define WWDG_CFGR_W2                            ((uint16_t)0x0004) /* Bit 2 */
#define WWDG_CFGR_W3                            ((uint16_t)0x0008) /* Bit 3 */
#define WWDG_CFGR_W4                            ((uint16_t)0x0010) /* Bit 4 */
#define WWDG_CFGR_W5                            ((uint16_t)0x0020) /* Bit 5 */
#define WWDG_CFGR_W6                            ((uint16_t)0x0040) /* Bit 6 */

#define WWDG_CFGR_WDGTB                         ((uint16_t)0x0180) /* WDGTB[1:0] bits (Timer Base) */
#define WWDG_CFGR_WDGTB0                        ((uint16_t)0x0080) /* Bit 0 */
#define WWDG_CFGR_WDGTB1                        ((uint16_t)0x0100) /* Bit 1 */

#define WWDG_CFGR_EWI                           ((uint16_t)0x0200) /* Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_STATR register  ********************/
#define WWDG_STATR_EWIF                         ((uint8_t)0x01) /* Early Wakeup Interrupt Flag */

/******************************************************************************/
/*                           ENHANCED FUNCTION                                */
/******************************************************************************/

/****************************  Enhanced register  *****************************/
#define EXTEN_USBD_LS                           ((uint32_t)0x00000001) /* Bit 0 */
#define EXTEN_USBD_PU_EN                        ((uint32_t)0x00000002) /* Bit 1 */
#define EXTEN_USBHD_IO_EN                       ((uint32_t)0x00000004) /* Bit 2 */
#define EXTEN_USB_5V_SEL                        ((uint32_t)0x00000008) /* Bit 3 */
#define EXTEN_PLL_HSI_PRE                       ((uint32_t)0x00000010) /* Bit 4 */
#define EXTEN_LOCKUP_EN                         ((uint32_t)0x00000040) /* Bit 5 */
#define EXTEN_LOCKUP_RSTF                       ((uint32_t)0x00000080) /* Bit 7 */

#define EXTEN_ULLDO_TRIM                        ((uint32_t)0x00000300) /* ULLDO_TRIM[1:0] bits */
#define EXTEN_ULLDO_TRIM0                       ((uint32_t)0x00000100) /* Bit 0 */
#define EXTEN_ULLDO_TRIM1                       ((uint32_t)0x00000200) /* Bit 1 */

#define EXTEN_IDO_TRIM                          ((uint32_t)0x00000400) /* Bit 10 */
#define EXTEN_WRITE_EN                          ((uint32_t)0x00004000) /* Bit 14 */
#define EXTEN_SHORT_WAKE                        ((uint32_t)0x00008000) /* Bit 15 */

#define EXTEN_FLASH_CLK_TRIM                    ((uint32_t)0x00070000) /* FLASH_CLK_TRIM[2:0] bits */
#define EXTEN_FLASH_CLK_TRIM0                   ((uint32_t)0x00010000) /* Bit 0 */
#define EXTEN_FLASH_CLK_TRIM1                   ((uint32_t)0x00020000) /* Bit 1 */
#define EXTEN_FLASH_CLK_TRIM2                   ((uint32_t)0x00040000) /* Bit 2 */

/******************************************************************************/
/*                             USBHD FUNCTION                                 */
/******************************************************************************/

/******************************  CTRL register  *******************************/
#define UC_DMA_EN                               ((uint8_t)0x01)        /* Enable DMA mode */
#define UC_CLR_ALL                              ((uint8_t)0x02)        /* Clear USB FIFO and interrupt flag */
#define UC_RESET_SIE                            ((uint8_t)0x04)        /* Reset USB protocol processor */
#define UC_INT_BUSY                             ((uint8_t)0x08)        /* Auto-suspend enable */
#define MASK_UC_SYS_CTRL                        ((uint8_t)0x30)        /* USB system configuration */
#define UC_DEV_PU_EN                            ((uint8_t)0x20)        /* USB device and pull-up enable */
#define UC_LOW_SPEED                            ((uint8_t)0x40)        /* 0: 12Mbps, 1: 1.5Mbps */
#define UC_HOST_MODE                            ((uint8_t)0x80)        /* 0: Host mode, 1: Device mode */

/*****************************  INT_EN register  *****************************/
#define UIE_DETECT                              ((uint8_t)0x01)        /* USB host: device (dis)connect interrupt */
#define UIE_BUS_RST                             ((uint8_t)0x01)        /* USB device: bus reset interrupt */
#define UIE_TRANSFER                            ((uint8_t)0x02)        /* USB transfer completion interrupt */
#define UIE_SUSPEND                             ((uint8_t)0x04)        /* USB bus suspend/wake-up interrupt */
#define UIE_HST_SOF                             ((uint8_t)0x08)        /* USB host: SOF timing interrupt */
#define UIE_FIFO_OV                             ((uint8_t)0x10)        /* FIFO overrun interrupt */
#define UIE_DEV_NAK                             ((uint8_t)0x40)        /* USB device: receive NAK interrupt */
#define UIE_DEV_SOF                             ((uint8_t)0x80)        /* USB device: receive SOF packet interrupt */

/*****************************  DEV_AD register  *****************************/
#define MASK_USB_ADDR                           ((uint8_t)0x7f)        /* USB device address */
#define UDA_GP_BIT                              ((uint8_t)0x80)        /* USB general flag, user self-defined */

/*****************************  MIS_ST register  *****************************/
#define UMS_DEV_ATTACH                          ((uint8_t)0x01)        /* USB host: USB device connected to port */
#define UMS_DM_LEVEL                            ((uint8_t)0x02)        /* USB host: 0: full speed, 1: low speed */
#define UMS_SUSPEND                             ((uint8_t)0x04)        /* USB suspension status */
#define UMS_BUS_RESET                           ((uint8_t)0x08)        /* USB bus reset status */
#define UMS_R_FIFO_RDY                          ((uint8_t)0x10)        /* USB receiver FIFO data ready status */
#define UMS_SIE_FREE                            ((uint8_t)0x20)        /* USB protocol processor idle status */
#define UMS_SOF_ACT                             ((uint8_t)0x40)        /* USB host: SOF packet transmission status */
#define UMS_SOF_PRES                            ((uint8_t)0x80)        /* USB host: SOF packet indicator status */

