wagiminator/MCU-Templates/CH32V103/template/src/ch32v103.h
/*****************************  INT_FG register  *****************************/
#define UIF_DETECT                              ((uint8_t)0x01)        /* USB host: device (dis)connect interrupt */
#define UIF_BUS_RST                             ((uint8_t)0x01)        /* USB device: bus reset interrupt */
#define UIF_TRANSFER                            ((uint8_t)0x02)        /* USB transfer completion interrupt */
#define UIF_SUSPEND                             ((uint8_t)0x04)        /* USB bus suspend/wake-up interrupt */
#define UIF_HST_SOF                             ((uint8_t)0x08)        /* USB host: SOF timing interrupt */
#define UIF_FIFO_OV                             ((uint8_t)0x10)        /* FIFO overrun interrupt */
#define U_SIE_FREE                              ((uint8_t)0x20)        /* USB protocol processor idle status */
#define U_TOG_OK                                ((uint8_t)0x40)        /* Current synchronous flag match status */
#define U_IS_NAK                                ((uint8_t)0x80)        /* USB device: NAK acknowledge status */

/*****************************  INT_ST register  *****************************/
#define MASK_UIS_H_RES                          ((uint8_t)0x0f)        /* USB host: response PID of current transfer */
#define MASK_UIS_ENDP                           ((uint8_t)0x0f)        /* USB device: endpoint number of current transfer */
#define MASK_UIS_TOKEN                          ((uint8_t)0x30)        /* USB device: token PID of current transfer */
#define UIS_TOKEN_OUT                           ((uint8_t)0x00)
#define UIS_TOKEN_SOF                           ((uint8_t)0x10)
#define UIS_TOKEN_IN                            ((uint8_t)0x20)
#define UIS_TOKEN_SETUP                         ((uint8_t)0x30)
#define UIS_TOG_OK                              ((uint8_t)0x40)        /* Current synchronous flag match status */
#define UIS_IS_NAK                              ((uint8_t)0x80)        /* USB device: NAK acknowledge status */

/*****************************  RX_LEN register  *****************************/
#define MASK_RX_LEN                             ((uint16_t)0x03ff)     /* Number of bytes received by current endpoint */

/********************************  UDEV_CTRL  ********************************/
#define UD_PORT_EN                              ((uint8_t)0x01)        /* USB device physical port enable */
#define UD_GP_BIT                               ((uint8_t)0x02)        /* USB device mode general flag, user-defined */
#define UD_LOW_SPEED                            ((uint8_t)0x04)        /* USB device physical port low-speed enable */
#define UD_DM_PIN                               ((uint8_t)0x10)        /* Current UDM pin status */
#define UD_DP_PIN                               ((uint8_t)0x20)        /* Current UDP pin status */
#define UD_PD_DIS                               ((uint8_t)0x80)        /* UDP/UDM pull-down disable */

/********************************  UEP4_1_MOD  *******************************/
#define UEP4_BUF_MOD                            ((uint8_t)0x01)        /* Endpoint 4 (8/12) data buffer mode */
#define UEP4_TX_EN                              ((uint8_t)0x04)        /* Enable endpoint 4 (8/12) transmission (IN) */
#define UEP4_RX_EN                              ((uint8_t)0x08)        /* Enable endpoint 4 (8/12) reception (OUT) */
#define UEP1_BUF_MOD                            ((uint8_t)0x10)        /* Endpoint 1 (9) data buffer mode */
#define UEP1_TX_EN                              ((uint8_t)0x40)        /* Enable endpoint 1 (9) transmission (IN) */
#define UEP1_RX_EN                              ((uint8_t)0x80)        /* Enable endpoint 1 (9) reception (OUT) */

/********************************  UEP2_3_MOD  *******************************/
#define UEP2_BUF_MOD                            ((uint8_t)0x01)        /* Endpoint 2 (10) data buffer mode */
#define UEP2_TX_EN                              ((uint8_t)0x04)        /* Enable endpoint 2 (10) transmission (IN) */
#define UEP2_RX_EN                              ((uint8_t)0x08)        /* Enable endpoint 2 (10) reception (OUT) */
#define UEP3_BUF_MOD                            ((uint8_t)0x10)        /* Endpoint 3 (11) data buffer mode */
#define UEP3_TX_EN                              ((uint8_t)0x40)        /* Enable endpoint 3 (11) transmission (IN) */
#define UEP3_RX_EN                              ((uint8_t)0x80)        /* Enable endpoint 3 (11) reception (OUT) */

/********************************  UEP5_6_MOD  *******************************/
#define UEP5_BUF_MOD                            ((uint8_t)0x01)        /* Endpoint 5 (13) data buffer mode */
#define UEP5_TX_EN                              ((uint8_t)0x04)        /* Enable endpoint 5 (13) transmission (IN) */
#define UEP5_RX_EN                              ((uint8_t)0x08)        /* Enable endpoint 5 (13) reception (OUT) */
#define UEP6_BUF_MOD                            ((uint8_t)0x10)        /* Endpoint 6 (14) data buffer mode */
#define UEP6_TX_EN                              ((uint8_t)0x40)        /* Enable endpoint 6 (14) transmission (IN) */
#define UEP6_RX_EN                              ((uint8_t)0x80)        /* Enable endpoint 6 (14) reception (OUT) */

/*********************************  UEP7_MOD  ********************************/
#define UEP7_BUF_MOD                            ((uint8_t)0x01)        /* Endpoint 7 (15) data buffer mode */
#define UEP7_TX_EN                              ((uint8_t)0x04)        /* Enable endpoint 7 (15) transmission (IN) */
#define UEP7_RX_EN                              ((uint8_t)0x08)        /* Enable endpoint 7 (15) reception (OUT) */

/********************************  UEPn_CTRL  ********************************/
#define MASK_UEP_T_RES                          ((uint8_t)0x03)        /* Response control by transmitter to IN services */
#define UEP_T_RES_ACK                           ((uint8_t)0x00)        /* Rensponse ACK (ready) to IN services */
#define UEP_T_RES_TOUT                          ((uint8_t)0x01)        /* No response to IN services */
#define UEP_T_RES_NAK                           ((uint8_t)0x02)        /* Rensponse NAK (busy) to IN services */
#define UEP_T_RES_STALL                         ((uint8_t)0x03)        /* Rensponse STALL (error) to IN services */
#define MASK_UEP_R_RES                          ((uint8_t)0x0c)        /* Response control by transmitter to OUT services */
#define UEP_R_RES_ACK                           ((uint8_t)0x00)        /* Rensponse ACK (ready) to OUT services */
#define UEP_R_RES_TOUT                          ((uint8_t)0x04)        /* No response to OUT services */
#define UEP_R_RES_NAK                           ((uint8_t)0x08)        /* Rensponse NAK (busy) to OUT services */
#define UEP_R_RES_STALL                         ((uint8_t)0x0c)        /* Rensponse STALL (error) to OUT services */
#define UEP_AUTO_TOG                            ((uint8_t)0x10)        /* Synchronous trigger bit auto flip enable */
#define UEP_T_TOG                               ((uint8_t)0x40)        /* Synchronization trigger bit for IN services */
#define UEP_R_TOG                               ((uint8_t)0x80)        /* Synchronization trigger bit for OUT services */
#define MASK_UEP_RES   (MASK_UEP_T_RES | MASK_UEP_R_RES)

/********************************  UHOST_CTRL  *******************************/
#define UH_PORT_EN                              ((uint8_t)0x01)        /* USB host port enable */
#define UH_BUS_RESET                            ((uint8_t)0x02)        /* USB host mode bus reset */
#define UH_LOW_SPEED                            ((uint8_t)0x04)        /* USB host port low-speed mode enable */
#define UH_DM_PIN                               ((uint8_t)0x10)        /* Current UDM pin status */
#define UH_DP_PIN                               ((uint8_t)0x20)        /* Current UDP pin status */
#define UH_PD_DIS                               ((uint8_t)0x80)        /* USB host port UDP/UDM pull-down disable */

/*********************************  UH_EP_MOD  *******************************/
#define UH_EP_RBUF_MOD                          ((uint8_t)0x01)        /* USB host reception endpoint data buffer mode */
#define UH_EP_RX_EN                             ((uint8_t)0x08)        /* Host reception endpoint receive (IN) enable */
#define UH_EP_TBUF_MOD                          ((uint8_t)0x10)        /* Host transmission endpoint data buffer mode */
#define UH_EP_TX_EN                             ((uint8_t)0x40)        /* Host transmission endpoint transmit (SETUP/OUT) enable */

/*********************************  UH_SETUP  ********************************/
#define UH_SOF_EN                               ((uint8_t)0x40)        /* Automatically generate SOF packet enable */
#define UH_PRE_PID_EN                           ((uint8_t)0x80)        /* Low-speed preamble packet PRE PID enable */

/*********************************  UH_EP_PID  *******************************/
#define MASK_UH_ENDP                            ((uint8_t)0x0f)        /* Set endpoint number of current target device */
#define MASK_UH_TOKEN                           ((uint8_t)0xf0)        /* Set token PID identification of this USB transmission */

/********************************  UH_RX_CTRL  *******************************/
#define UH_R_RES                                ((uint8_t)0x04)        /* Control on response to IN transactions */
#define UH_R_AUTO_TOG                           ((uint8_t)0x10)        /* Synchronous trigger bit auto flip enable */
#define UH_R_TOG                                ((uint8_t)0x80)        /* Synchronous trigger bit expected by receiver */

