wagiminator/MCU-Templates/CH32V103/template/src/ch32v103.h
/********************************  UH_TX_CTRL  *******************************/
#define UH_T_RES                                ((uint8_t)0x01)        /* Response control to SETUP/OUT transaction */
#define UH_T_AUTO_TOG                           ((uint8_t)0x10)        /* Synchronous trigger bit auto flip enable */
#define UH_T_TOG                                ((uint8_t)0x40)        /* Synchronous trigger bit prepared by transmitter */

/***************************  USB host mode aliases  *************************/
#define UHOST_CTRL      UDEV_CTRL
#define UH_EP_MOD       UEP2_3_MOD
#define UH_RX_DMA       UEP2_DMA
#define UH_TX_DMA       UEP3_DMA
#define UH_SETUP        UEP1_CTRL
#define UH_EP_PID       UEP2_T_LEN
#define UH_RX_CTRL      UEP2_CTRL
#define UH_TX_LEN       UEP3_T_LEN
#define UH_TX_CTRL      UEP3_CTRL

/******************************************************************************/
/*               Programmable Fast Interrupt Controller (PFIC)                */
/******************************************************************************/

/******************  Bit definition for PFIC_CFGR register  *******************/
#define PFIC_RESETSYS                           ((uint32_t)0x00000080) /* System reset */
#define PFIC_KEY1                               ((uint32_t)0xFA050000)
#define PFIC_KEY2                               ((uint32_t)0xBCAF0000)
#define PFIC_KEY3                               ((uint32_t)0xBEEF0000)
#define NVIC_KEY1                               ((uint32_t)0xFA050000)
#define NVIC_KEY2                               ((uint32_t)0xBCAF0000)
#define NVIC_KEY3                               ((uint32_t)0xBEEF0000)

/******************  Bit definition for PFIC_SCTLR register  ******************/
#define PFIC_SYSRESET                           ((uint32_t)0x80000000) /* System reset */
#define PFIC_SETEVENT                           ((uint32_t)0x00000020) /* Set event to wake up WFE case */
#define PFIC_SEVONPEND                          ((uint32_t)0x00000010) /* All events and IRQ can wake up */
#define PFIC_WFITOWFE                           ((uint32_t)0x00000008) /* Treat WFI as WFE */
#define PFIC_SLEEPDEEP                          ((uint32_t)0x00000004) /* 1:deep sleep; 0:sleep */
#define PFIC_SLEEPONEXIT                        ((uint32_t)0x00000002) /* 1:sleep after ISR */

/******************************************************************************/
/*                       System Counter (STK / SysTick)                       */
/******************************************************************************/

/*******************  Bit definition for STK_CTLR register  *******************/
#define STK_CTLR_STE                            ((uint32_t)0x00000001) /* System counter enable */
#define STK_CTLR_SWIE                           ((uint32_t)0x80000000) /* Software interrupt enable */

#ifdef __cplusplus
}
#endif
